src/cf/src/Documents/НалоговаяНакладнаяПокупка/НалоговаяНакладнаяПокупка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НалоговаяНакладнаяПокупка</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦеныПоТипуЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМинимальная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоТипуЦен</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеТовара</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеТовара</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСпособыОплаты</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДенежныхСредств</name>
      <type>
        <types>CatalogRef.TypesDePayment</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>CatalogRef.БанковскиеЧеки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/НалоговаяНакладнаяПокупка/ManagerModule.bsl
#Область Печать

Процедура ПечатьПоступлениеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПоступлениеТоваровУслуг_ПоступлениеТоваров";
	Макет = Документы.ПоступлениеТоваровУслуг.ПолучитьМакет("ПоступлениеТоваров");
	// Шапка
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Bon de réception");
	//оШапка.Параметры.Контрагент = Док.Контрагент;
	оШапка.Параметры.Организация = Док.Организация;
	Таб.Вывести(оШапка);
	// Строки
	оСтрока = Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из Док.ТЧТовары Цикл
		оСтрока.Параметры.НомерСтроки = Стр.НомерСтроки;
		оСтрока.Параметры.Номенклатура = Стр.Номенклатура;
		оСтрока.Параметры.ID = Стр.Номенклатура.Артикул;
		//оСтрока.Параметры.Количество = Стр.Количество;
		оСтрока.Параметры.Единица = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	//// Итого
	//оИтого = Макет.ПолучитьОбласть("Итого");
	//оИтого.Параметры.Всего = Док.Сумма;
	//Таб.Вывести(оИтого);
	//// НДС
	//оНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	//оНДС.Параметры.НДС = "TVA";
	//оНДС.Параметры.ВсегоНДС = Док.ТЧТовары.Итог("СуммаНДС");
	//Таб.Вывести(оНДС);
	//// Сумма прописью
	//Валюта = Справочники.Валюты.MoroccanDirham;
	//оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	////оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(Док.ТЧТовары.Количество()) 
	////	+ ", на сумму " + Формат(Док.Сумма, "ЧЦ=12; ЧДЦ=2") + " руб.";
	//оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	//Таб.Вывести(оСуммаПрописью);
	// Подписи
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ПечатьАктаОбОказанииУслуг(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПоступлениеТоваровУслуг_АктОбОказанииУслуг";
	Макет = ПолучитьОбщийМакет("АктОбОказанииУслуг");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
	Таб.Вывести(оЗаголовок);
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");	
	оПоставщик.Параметры.ПредставлениеПоставщика = Док.Контрагент;
	Таб.Вывести(оПоставщик);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Организация;
	оПолучатель.Параметры.Основание = Док.Договор;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	ТЗ = Док.ТЧУслуги.Выгрузить();	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока = Макет.ПолучитьОбласть("Строка"); 
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Номенклатура = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Содержание);
		оСтрока.Параметры.ЕдиницаИзмерения = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	ОИтого = Макет.ПолучитьОбласть("Итого");
	ОИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОИтого);
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	ОСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() 
	+ ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"),Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОСуммаПрописью);
	
	ОПодписи = Макет.ПолучитьОбласть("Подписи");
	ОПодписи.Параметры.НазваниеОрганизации = Док.Контрагент;
	ОПодписи.Параметры.НазваниеЗаказчика = Док.Организация;
	Таб.Вывести(ОПодписи);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
КонецПроцедуры

Function PrintFacture(Док, Spreadsheet) Export
	Template = Документы.НалоговаяНакладнаяПокупка.ПолучитьМакет("Facture");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	Doc.Ссылка.Контрагент КАК Client,
	|	Doc.Ссылка.Ответственный КАК Createur,
	|	Doc.Ссылка.Дата КАК Date,
	|	Doc.Ссылка.Номер КАК Number,
	|	Doc.Ссылка.Договор.ВалютаВзаиморасчётов КАК Devise,
	|	Doc.Ссылка.Сумма КАК TotalSomme,
	|	Doc.Ссылка.Ссылка КАК DocRef,
	|	Doc.НомерСтроки КАК LineNumber,
	|	Doc.Номенклатура КАК Produit,
	|	Doc.Количество КАК Quantite,
	|	Doc.Цена КАК Prix,
	|	Doc.СтавкаНДС КАК TVA,
	|	Doc.СуммаНДС КАК SommeTVA,
	|	Doc.Сумма КАК Somme,
	|	Doc.СуммаСНДС КАК SommeTotale,
	|	Doc.Ссылка.Организация КАК Organisation,
	|	Doc.Ссылка.Основание КАК Основание,
	|	Doc.ПоступлениеТовара КАК BL,
	|	Doc.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧТовары КАК Doc
	|ГДЕ
	|	Doc.Ссылка = &Ref
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Doc.Ссылка.Контрагент,
	|	Doc.Ссылка.Ответственный,
	|	Doc.Ссылка.Дата,
	|	Doc.Ссылка.Номер,
	|	Doc.Ссылка.Договор.ВалютаВзаиморасчётов,
	|	Doc.Ссылка.Сумма,
	|	Doc.Ссылка.Ссылка,
	|	0,
	|	Doc.Номенклатура,
	|	Doc.Количество,
	|	Doc.Цена,
	|	Doc.СтавкаНДС,
	|	Doc.СуммаНДС,
	|	Doc.Сумма,
	|	Doc.СуммаСНДС,
	|	Doc.Ссылка.Организация,
	|	Doc.Ссылка.Основание,
	|	Doc.ПоступлениеТовара,
	|	Doc.Ссылка
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧУслуги КАК Doc
	|ГДЕ
	|	Doc.Ссылка = &Ref
	|
	|УПОРЯДОЧИТЬ ПО
	|	BL
	|ИТОГИ ПО
	|	Ссылка";
	Query.Parameters.Insert("Ref", Док);
	Selection = Query.Execute().Select(ОбходРезультатаЗапроса.ПоГруппировкам);

	//AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	AreaTabularSectionHeader = Template.GetArea("TabularSectionHeader");
	AreaTabularSection = Template.GetArea("TabularSection");
	AreaTabularSectionEmptyLine = Template.GetArea("EmptyLine");
	AreaTabularSectionFooterSousTotal = Template.GetArea("TabularSectionFooterSousTotal");
	AreaTabularSectionFooterRemise = Template.GetArea("TabularSectionFooterRemise");
	AreaTabularSectionFooterTotal = Template.GetArea("TabularSectionFooterTotal"); 
	AreaTabularSectionFooterTotalTaxe = Template.GetArea("TabularSectionFooterTotalTaxe");
	AreaTabularSectionAmountInWritten = Template.GetArea("AmountInWritten");
	AreaTabularSectionLineBC = Template.GetArea("LineBC");
	ОбластьПустаяСтрока = Template.GetArea("ОбластьПустаяСтрока");
	Spreadsheet.РазмерСтраницы = "A4";
	
	InsertPageBreak = False;
	While Selection.Next() Do
	  //FieldPhoto = Selection.Organisation.ФонПечатныхФорм.Get();
	  //  Try
	  //  	Картинка = New Picture(FieldPhoto,Истина);
	  //  	Spreadsheet.ФоноваяКартинка = Картинка;
	  //  Except
	  //  EndTry;
        НомерСтраницы = 1;
		FirstRowNumber = Spreadsheet.TableHeight + 1;
		Header.Parameters.Fill(Selection);
		Header.Parameters.Number = Selection.Number+"/"+Format(Selection.Date,"Л=fr; ДФ=yy; ДЛФ=DD");
		Header.Parameters.Date = Format(Selection.Date,"Л=fr; ДФ=dd/MM/yyyy; ДЛФ=DD");
		
    	ClientCard = Справочники.Контрагенты.ПолучитьКарточку(Selection.Client, Док.Дата);
		Client = ""+Selection.Client.Description;
		Если ЗначениеЗаполнено(ClientCard.Реквизиты.АдресФактический) Тогда 
			Client = Client +Символы.ПС+ClientCard.Реквизиты.АдресФактический;
		ИначеЕсли ЗначениеЗаполнено(ClientCard.Реквизиты.АдресЮридический) Тогда 
			Client = Client + Символы.ПС + ClientCard.Реквизиты.АдресЮридический;
		КонецЕсли;
		
		Header.Parameters.Client = Client;
		Header.Parameters.Комментарий = Док.Комментарий;
		Header.Parameters.ICE = ClientCard.Реквизиты.ICE;
		Header.Parameters.CodeClient = Selection.Client.Код;
		Spreadsheet.Put(Header, Selection.Level());
		
		//TotalRemise = 0;
		TotalSommeTVA = 0;
		TotalSomme = 0;
        BL = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		Spreadsheet.Put(AreaTabularSectionHeader);
		SelectionTabularSection = Selection.Select();
		While SelectionTabularSection.Next() Do
			Если Не BL = SelectionTabularSection.BL И ЗначениеЗаполнено(SelectionTabularSection.BL) Тогда
				BL = SelectionTabularSection.BL;
				AreaTabularSectionLineBC.Parameters.BL = "BL: "+РаботаСДокументами.СформироватьЦифровойНомер(BL.Number)+"/"+Format(BL.Date,"Л=fr; ДФ=yy; ДЛФ=DD") + " " + Format(BL.Date,"Л=fr; ДФ=dd/MM/yyyy; ДЛФ=DD");
				Spreadsheet.Put(AreaTabularSectionLineBC);
			КонецЕсли;
			AreaTabularSection.Parameters.Fill(SelectionTabularSection);
			AreaTabularSection.Parameters.ID = SelectionTabularSection.Produit.Артикул;
			AreaTabularSection.Parameters.Descriptif = SelectionTabularSection.Produit;
			AreaTabularSection.Parameters.Prix = SelectionTabularSection.Prix;
			AreaTabularSection.Parameters.TauxTVA = SelectionTabularSection.TVA;
			AreaTabularSection.Parameters.TVA = SelectionTabularSection.SommeTVA;
			МасОбластей = Новый Массив;
			МасОбластей.Добавить(AreaTabularSection);
			МасОбластей.Добавить(AreaTabularSection);
			//МасОбластей.Добавить(AreaTabularSectionFooterSousTotal);
			//МасОбластей.Добавить(AreaTabularSectionFooterTotalTaxe);
			//МасОбластей.Добавить(AreaTabularSectionFooterTotal);
			//МасОбластей.Добавить(AreaTabularSectionAmountInWritten);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			Если Не Spreadsheet.ПроверитьВывод(МасОбластей) Тогда
				МасОбластей = Новый Массив;
				МасОбластей.Добавить(ОбластьПустаяСтрока);
				//Пока Spreadsheet.ПроверитьВывод(МасОбластей) Цикл 
				Для НомерПроверки = 1 по 5 Цикл 
					МасОбластей = Новый Массив;
					МасОбластей.Добавить(ОбластьПустаяСтрока);
					//МасОбластей.Добавить(ОбластьПустаяСтрока);
					//МасОбластей.Добавить(ОбластьПустаяСтрока);
					Если Не Spreadsheet.ПроверитьВывод(МасОбластей) Тогда
						Прервать;
					иначе
						Spreadsheet.Put(ОбластьПустаяСтрока);
					КонецЕсли;
				КонецЦикла;
				Spreadsheet.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы + 1;
				//Header.Parameters.PageNumber = НомерСтраницы;
				Spreadsheet.Put(Header, Selection.Level());
				Spreadsheet.Put(AreaTabularSectionHeader, Selection.Level());
			КонецЕсли;
			Spreadsheet.Put(AreaTabularSection, SelectionTabularSection.Level());
			//TotalRemise = TotalRemise + SelectionTabularSection.Remise;
			TotalSomme = TotalSomme + SelectionTabularSection.Somme;
			TotalSommeTVA = TotalSommeTVA + SelectionTabularSection.SommeTVA;
		EndDo;
		
		Для НомерПроверки = 1 по 50 Цикл 
			МасОбластей = Новый Массив;
			МасОбластей.Добавить(AreaTabularSection);
			МасОбластей.Добавить(AreaTabularSection);
			МасОбластей.Добавить(AreaTabularSectionFooterSousTotal);
			МасОбластей.Добавить(AreaTabularSectionFooterTotalTaxe);
			МасОбластей.Добавить(AreaTabularSectionFooterTotal);
			МасОбластей.Добавить(AreaTabularSectionAmountInWritten);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			Если Не Spreadsheet.ПроверитьВывод(МасОбластей) Тогда
				//Если СФоном Тогда 
				//	Spreadsheet.Put(ОбластьНизРеквизиты);
				//КонецЕсли;
				Прервать;
			иначе
				Spreadsheet.Put(AreaTabularSectionEmptyLine);
			КонецЕсли;
		КонецЦикла;
		
		AreaTabularSectionFooterSousTotal.Parameters.SousTotal = ""+Format(Selection.TotalSomme-TotalSommeTVA,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		//СпособОплаты = РаботаСДокументами.ПолучитьСпособОплаты(Док);
		СпособОплаты = РаботаСДокументами.ПолучитьСпособОплаты(Док);
		Если Не ЗначениеЗаполнено(СпособОплаты) Тогда 
			СпособОплаты = Selection.Client.ТипОплаты;
		КонецЕсли;
		AreaTabularSectionFooterSousTotal.Parameters.СпособОплаты = СпособОплаты;
		Spreadsheet.Put(AreaTabularSectionFooterSousTotal);
		//If TotalRemise <> 0 Then 
		//	AreaTabularSectionFooterRemise.Parameters.Remise = ""+Format(TotalRemise,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		//	Spreadsheet.Put(AreaTabularSectionFooterRemise);
		//EndIf;
		
		AreaTabularSectionFooterTotalTaxe.Parameters.TotalTaxe = ""+Format(TotalSommeTVA,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		Spreadsheet.Put(AreaTabularSectionFooterTotalTaxe);
		
		AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(Selection.TotalSomme,"NFD=2; NZ=0,00")+" "+Selection.Devise;
		Spreadsheet.Put(AreaTabularSectionFooterTotal);
		
		TextAmountInWritten = "Arrêtée la présente facture à la somme de :";
		AmountInWritten = Справочники.Валюты.СформироватьСуммуПрописью(Selection.TotalSomme,Константы.ВалютаРегламентированногоУчета.Получить(),Перечисления.Локализации.fr_CA);
		TextAmountInWritten = TextAmountInWritten + Символы.ПС +" *** "+ ВРег(AmountInWritten) + " *** ";
		AreaTabularSectionAmountInWritten.Параметры.AmountInWritten = TextAmountInWritten;
		Spreadsheet.Put(AreaTabularSectionAmountInWritten);
		
		//Spreadsheet.BottomMargin = 10;
		Для НомерПроверки = 1 по 5 Цикл 
			МасОбластей = Новый Массив;
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			МасОбластей.Добавить(ОбластьПустаяСтрока);
			Если Не Spreadsheet.ПроверитьВывод(МасОбластей) Тогда
				Прервать;
			иначе
				Spreadsheet.Put(ОбластьПустаяСтрока);
			КонецЕсли;
		КонецЦикла;
		Spreadsheet.PutHorizontalPageBreak();
	EndDo; 
	
	Spreadsheet.FitToPage = True;
	Spreadsheet.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Facture");
	Return Spreadsheet;
	
EndFunction

#КонецОбласти
